# Merging two datasets

In [1]:
import pandas as pd
import numpy as np

In [5]:
data_1={
    'ID':[1,2,3,4],
    'Name':['Alice','Bob','Charlie','David'],
    'age':[25,30,35,40]
}

data_2={
    'ID':[1,2,3,4],
    'Salary':[70000,80000,90000,100000],
    'city':['New York','Los Angeles','Chicago','Houston']
}

df1=pd.DataFrame(data_1)
df2=pd.DataFrame(data_2)

df1

   ID     Name  age
0   1    Alice   25
1   2      Bob   30
2   3  Charlie   35
3   4    David   40

In [6]:
# merge data on 'ID' column
merged_df=pd.merge(df1,df2,on='ID', how='inner')
merged_df

   ID     Name  age  Salary         city
0   1    Alice   25   70000     New York
1   2      Bob   30   80000  Los Angeles
2   3  Charlie   35   90000      Chicago
3   4    David   40  100000      Houston

# Merged data